#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.infrastructure.module.kubernetes_config.helm_release.elasticsearch is tainted, so must be replaced
-/+ resource "helm_release" "elasticsearch" {
        atomic                = false
        chart                 = "elasticsearch"
        cleanup_on_fail       = false
        dependency_update     = false
        disable_crd_hooks     = false
        disable_webhooks      = false
        force_update          = false
      ~ id                    = "elasticsearch" -> (known after apply)
        max_history           = 0
      ~ metadata              = [
          - {
              - chart     = "elasticsearch"
              - name      = "elasticsearch"
              - namespace = "default"
              - revision  = 1
              - values    = jsonencode(
                    {
                      - esConfig     = {
                          - elasticsearch.yml = <<~EOT
                                xpack.security.enabled: true
                                xpack.security.transport.ssl.enabled: true
                                xpack.security.transport.ssl.verification_mode: certificate
                                xpack.security.transport.ssl.key: /usr/share/elasticsearch/config/certs/private_key_pem.crt
                                xpack.security.transport.ssl.certificate: /usr/share/elasticsearch/config/certs/certificate_pem.crt
                                xpack.security.transport.ssl.certificate_authorities: [ "/usr/share/elasticsearch/config/certs/issuer_pem.crt" ]
                            EOT
                        }
                      - secretMounts = [
                          - {
                              - name       = "elastic-certificates"
                              - path       = "/usr/share/elasticsearch/config/certs"
                              - secretName = "elasticsearch-certificates"
                            },
                        ]
                    }
                )
              - version   = "7.6.1"
            },
        ] -> (known after apply)
        name                  = "elasticsearch"
        namespace             = "default"
        recreate_pods         = false
        render_subchart_notes = true
        replace               = false
        repository            = "https://helm.elastic.co"
        reset_values          = false
        reuse_values          = false
        skip_crds             = false
      ~ status                = "failed" -> "deployed"
        timeout               = 300
      ~ values                = [
          - <<~EOT
                esConfig:
                  elasticsearch.yml: |
                    xpack.security.enabled: true
                    xpack.security.transport.ssl.enabled: true
                    xpack.security.transport.ssl.verification_mode: certificate
                    xpack.security.transport.ssl.key: /usr/share/elasticsearch/config/certs/private_key_pem.crt
                    xpack.security.transport.ssl.certificate: /usr/share/elasticsearch/config/certs/certificate_pem.crt
                    xpack.security.transport.ssl.certificate_authorities: [ "/usr/share/elasticsearch/config/certs/issuer_pem.crt" ]
                
                secretMounts:
                  - name: elastic-certificates
                    secretName: elasticsearch-certificates
                    path: /usr/share/elasticsearch/config/certs
            EOT,
          + <<~EOT
                esConfig:
                  elasticsearch.yml: |
                    xpack.security.enabled: true
                    xpack.security.transport.ssl.enabled: true
                    xpack.security.transport.ssl.verification_mode: certificate
                    xpack.security.transport.ssl.key: /usr/share/elasticsearch/config/certs/private_key_pem.crt
                    xpack.security.transport.ssl.certificate: /usr/share/elasticsearch/config/certs/certificate_pem.crt
                    xpack.security.transport.ssl.certificate_authorities: [ "/usr/share/elasticsearch/config/certs/issuer_pem.crt" ]
                
                extraEnvs:
                  - name: ELASTIC_PASSWORD
                    valueFrom:
                      secretKeyRef:
                        name: elastic-credentials
                        key: password
                  - name: ELASTIC_USERNAME
                    valueFrom:
                      secretKeyRef:
                        name: elastic-credentials
                        key: username
                
                secretMounts:
                  - name: elastic-certificates
                    secretName: elasticsearch-certificates
                    path: /usr/share/elasticsearch/config/certs
            EOT,
        ]
        verify                = false
        version               = "7.6.1"
        wait                  = true
    }

  # module.infrastructure.module.kubernetes_config.kubernetes_secret.elastic_credentials will be created
  + resource "kubernetes_secret" "elastic_credentials" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "elastic-credentials"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.infrastructure.module.kubernetes_config.random_password.elasticsearch_password will be created
  + resource "random_password" "elasticsearch_password" {
      + id          = (known after apply)
      + length      = 64
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

Plan: 3 to add, 0 to change, 1 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "api_secret_key_base" but a
value was found in file "/terraform/terraform.tfvars". To use this value, add
a "variable" block to the configuration.

Using a variables file to set an undeclared variable is deprecated and will
become an error in a future release. If you wish to provide certain "global"
settings to all configurations in your organization, use TF_VAR_...
environment variables to set these instead.

```

</details>

*Workflow: `Test infrastructure plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
